  ### Deployment Results ✅

  **jcetina** successfully deployed branch `jcetina/add-vms` to **production**

  <details><summary>Show Results</summary>

  ```terraform
[command]/home/runner/work/_temp/b1252946-7e57-4ce3-a913-ee1598356519/terraform-bin apply -no-color -auto-approve -compact-warnings

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

# module.k8s-cp[0].azurerm_linux_virtual_machine.vm will be created
+ resource "azurerm_linux_virtual_machine" "vm" {
    + admin_username                  = "adminuser"
    + allow_extension_operations      = true
    + computer_name                   = (known after apply)
    + disable_password_authentication = true
    + extensions_time_budget          = "PT1H30M"
    + id                              = (known after apply)
    + location                        = "eastus"
    + max_bid_price                   = -1
    + name                            = "k8s-cp-0"
    + network_interface_ids           = [
        + "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Network/networkInterfaces/k8s-cp-0-nic",
      ]
    + patch_mode                      = "ImageDefault"
    + platform_fault_domain           = -1
    + priority                        = "Regular"
    + private_ip_address              = (known after apply)
    + private_ip_addresses            = (known after apply)
    + provision_vm_agent              = true
    + public_ip_address               = (known after apply)
    + public_ip_addresses             = (known after apply)
    + resource_group_name             = "k8s"
    + size                            = "Standard_D4ads_v5"
    + virtual_machine_id              = (known after apply)
    + zone                            = "1"

    + admin_ssh_key {
        + public_key = <<-EOT
              ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDMpJlkSij1jlS09G/cIuX648Jx6aQsNm0w4OOGuQHFIs7JXT9deh/Dnf669s4Qy3D6MxkYWpQ85c4fMYJR66cgtAUhueLMuMaz0jp/v/Y27BiqcH7JR8qeVkIvvhmBDGBze6GGkk7jcuR2v81Uf4qVb2YuM4HfrD/5Md1CJR3oMOlyhTbnzQhzgYreLMEozmePsQlTArP67gX/mGYOZdNI1M7hp6Vt3OTJctg4bmDjkhJgoNbOBQh58ixv8KKtxHIXgdfEBwyBlsPjOMneOFqMWycPh8g9T1NXiU5I0pfyKRhThiQCVDFG8a2kVDe2Ylyp0dhKbmZUechPXIU0QStGiByhhbEEBoWXIyDTLPRKK9JoGV/jo+kay0Y34y9CKiwMFa8KdeYRba+XBp0W+rsHGzolN5YSOxODSTimh7x45KCZw0r9tg29mLpSDac66hzzR9VlBP0ikAoAXcHUTrmKsdQRwRnNJohVilfXgJdsu23GWw2sRe4b4X0M6h43X5c4eld/2vjclC4PEvNv2Jlo2ZALNkZGpD+ujTbsWRJBCGkN3GWKLmPnkkSvJP+v0F32k6FrDUhEBEj7Jk4m2qAuLwhHSdZ7d302hJLHApM+vW4kUYT5psg/MGppK4KvJg63Gu81I/FCd+nnn426UnApzHxEYvtlAWjKTM9TOgOxoQ== jcetina@jasons-mbp.lan
          EOT
        + username   = "adminuser"
      }

    + os_disk {
        + caching                   = "ReadWrite"
        + disk_size_gb              = (known after apply)
        + name                      = (known after apply)
        + storage_account_type      = "Standard_LRS"
        + write_accelerator_enabled = false
      }

    + source_image_reference {
        + offer     = "0001-com-ubuntu-server-jammy"
        + publisher = "Canonical"
        + sku       = "22_04-lts"
        + version   = "latest"
      }
  }

# module.k8s-node[0].azurerm_linux_virtual_machine.vm will be created
+ resource "azurerm_linux_virtual_machine" "vm" {
    + admin_username                  = "adminuser"
    + allow_extension_operations      = true
    + computer_name                   = (known after apply)
    + disable_password_authentication = true
    + extensions_time_budget          = "PT1H30M"
    + id                              = (known after apply)
    + location                        = "eastus"
    + max_bid_price                   = -1
    + name                            = "k8s-node-0"
    + network_interface_ids           = [
        + "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Network/networkInterfaces/k8s-node-0-nic",
      ]
    + patch_mode                      = "ImageDefault"
    + platform_fault_domain           = -1
    + priority                        = "Regular"
    + private_ip_address              = (known after apply)
    + private_ip_addresses            = (known after apply)
    + provision_vm_agent              = true
    + public_ip_address               = (known after apply)
    + public_ip_addresses             = (known after apply)
    + resource_group_name             = "k8s"
    + size                            = "Standard_D4ads_v5"
    + virtual_machine_id              = (known after apply)
    + zone                            = "1"

    + admin_ssh_key {
        + public_key = <<-EOT
              ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDMpJlkSij1jlS09G/cIuX648Jx6aQsNm0w4OOGuQHFIs7JXT9deh/Dnf669s4Qy3D6MxkYWpQ85c4fMYJR66cgtAUhueLMuMaz0jp/v/Y27BiqcH7JR8qeVkIvvhmBDGBze6GGkk7jcuR2v81Uf4qVb2YuM4HfrD/5Md1CJR3oMOlyhTbnzQhzgYreLMEozmePsQlTArP67gX/mGYOZdNI1M7hp6Vt3OTJctg4bmDjkhJgoNbOBQh58ixv8KKtxHIXgdfEBwyBlsPjOMneOFqMWycPh8g9T1NXiU5I0pfyKRhThiQCVDFG8a2kVDe2Ylyp0dhKbmZUechPXIU0QStGiByhhbEEBoWXIyDTLPRKK9JoGV/jo+kay0Y34y9CKiwMFa8KdeYRba+XBp0W+rsHGzolN5YSOxODSTimh7x45KCZw0r9tg29mLpSDac66hzzR9VlBP0ikAoAXcHUTrmKsdQRwRnNJohVilfXgJdsu23GWw2sRe4b4X0M6h43X5c4eld/2vjclC4PEvNv2Jlo2ZALNkZGpD+ujTbsWRJBCGkN3GWKLmPnkkSvJP+v0F32k6FrDUhEBEj7Jk4m2qAuLwhHSdZ7d302hJLHApM+vW4kUYT5psg/MGppK4KvJg63Gu81I/FCd+nnn426UnApzHxEYvtlAWjKTM9TOgOxoQ== jcetina@jasons-mbp.lan
          EOT
        + username   = "adminuser"
      }

    + os_disk {
        + caching                   = "ReadWrite"
        + disk_size_gb              = (known after apply)
        + name                      = (known after apply)
        + storage_account_type      = "Standard_LRS"
        + write_accelerator_enabled = false
      }

    + source_image_reference {
        + offer     = "0001-com-ubuntu-server-jammy"
        + publisher = "Canonical"
        + sku       = "22_04-lts"
        + version   = "latest"
      }
  }

Plan: 2 to add, 0 to change, 0 to destroy.
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Creating...
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Creating...
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Still creating... [10s elapsed]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Still creating... [10s elapsed]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Still creating... [20s elapsed]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Still creating... [20s elapsed]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Still creating... [30s elapsed]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Still creating... [30s elapsed]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Still creating... [40s elapsed]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Still creating... [40s elapsed]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Still creating... [50s elapsed]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Still creating... [50s elapsed]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Creation complete after 52s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Compute/virtualMachines/k8s-node-0]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Still creating... [1m0s elapsed]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Still creating... [1m10s elapsed]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Creation complete after 1m17s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Compute/virtualMachines/k8s-cp-0]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```

  </details>